## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.awkwardweirdterribleandbaddotcom.azurerm_dns_zone.this will be created
  + resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "awkwardweirdterribleandbad.com"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-azurelaboratory-external-dns"
      + tags                      = {
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>